[
  {
    "job_title": "Customer Service Assistant Manager 3IC - PPT [Drakes Torrensville]",
    "advertiser": "Drakes Supermarkets",
    "job_type": "Retail Assistants (Retail & Consumer Products)",
    "location": "Torrensville, Adelaide SA",
    "work_type": "Part time",
    "summary": "<div class=\"_1oozmqe0 bmnci70\"><div><div>\n <div>\n <p><strong>Exciting Career Opportunity</strong></p>\n<ul>\n<li>Attractive remuneration and 10% in-store discount</li>\n<li>Flexible working hours</li>\n<li>Potential for promotion</li>\n</ul>\n<p>Drakes Supermarkets is a Retail industry success story.&nbsp; A family owned and operated private company, we are Australia's largest independently-owned supermarket chain.&nbsp; Due to our unprecedented growth, we provide excellent career opportunities within our company.</p>\n<p>The successful applicant will be given the opportunity to supervisor the customer service department and tailor the stores service and products offered, in order to meet the specific needs of the customers within the local area.</p>\n<p><strong>Working as a part of an enthusiastic team, in a highly competitive supermarket environment, applicants will be expected to demonstrate:</strong></p>\n<ul>\n<li>Front end and POS knowledge</li>\n<li>Unparalleled commitment to customer service</li>\n<li>Passion and enthusiasm, with a very \"hands on\" approach</li>\n<li>Excellent communication skills</li>\n<li>Ability to liaise with both team members and management</li>\n<li>Strong leadership and delegation skills</li>\n<li>Ability to coach, train and performance manage team members</li>\n<li>Commitment to work health and safety standards</li>\n</ul>\n<p><strong>To succeed within our organisation, applicants must be able to:</strong></p>\n<ul>\n<li>Display a passion for customer service</li>\n<li>Express a positive \"can do\" attitude</li>\n<li>Problem solve</li>\n<li>Lead by example</li>\n<li>Motivate a team</li>\n<li>Communicate effectively with management, team members and customers</li>\n</ul> </div>\n </div></div></div>",
    "url": "https://drakesupermarkets.expr3ss.com/jobDetails?selectJob=2302&ppt=be69fbfb"
  },
  {
    "job_title": "Casual Store Assistant",
    "advertiser": "Drakes Supermarkets",
    "job_type": "Retail Assistants (Retail & Consumer Products)",
    "location": "Enfield, Adelaide SA",
    "work_type": "Casual/Vacation",
    "summary": "<div class=\"_1oozmqe0 bmnci70\"><p>Drakes Supermarkets is coming! We are a family owned and operated private company, and Australia's largest independently-owned supermarket chain. We are committed to supporting local producers and suppliers and pride ourselves on our unparalleled commitment to providing exceptional customer service!</p>\n<p>Our brand-new store in Lightsview is<strong> opening in October! </strong>There are a number of casual positions you can register your interest for across all departments of the supermarket including Bakery, Checkouts, Dairy, Fruit &amp; Veg, Nightfill and Service Deli.&nbsp;&nbsp;&nbsp;</p>\n<p>Drakes believes in promoting from within and offers development and training opportunities. This can assist in fast tracking you to a management position.</p>\n<p>Additionally, Drakes also offers extensive team member benefits such as 10% Team Member and family discount, as well as much more!</p>\n<p><strong>Register your interest Now, for all department vacancies if you...&nbsp;</strong></p>\n<ul>\n<li>Love helping customers</li>\n<li>Have the motivation to be successful</li>\n<li>Enjoy fast paced challenging work</li>\n<li>Are happy to be flexible</li>\n<li>Are looking for a dynamic career in retail</li>\n</ul>\n<p><strong>The successful applicants will be expected to:</strong></p>\n<ul>\n<li>Demonstrate passion and enthusiasm</li>\n<li>Show commitment to providing exceptional customer service</li>\n<li>Have excellent communication skills</li>\n<li>Be reliable and self-motivated</li>\n<li>Be able to work as part of a small and dedicated team</li>\n<li>Have high standards of personal hygiene and appearance</li>\n<li>Show commitment to work health and safety standards</li>\n</ul></div>",
    "url": "https://drakesupermarkets.expr3ss.com/jobDetails?selectJob=2139&s=239"
  },
  {
    "job_title": "Casual Bakery Assistant (Day Staff)",
    "advertiser": "Drakes Supermarkets",
    "job_type": "Retail Assistants (Retail & Consumer Products)",
    "location": "O'Halloran Hill, Adelaide SA",
    "work_type": "Casual/Vacation",
    "summary": "<div class=\"_1oozmqe0 bmnci70\"><p>If you ..........</p>\n<ul>\n<li>Love helping customers</li>\n<li>Have the motivation to be successful</li>\n<li>Enjoy fast paced challenging work</li>\n<li>Are happy to be flexible</li>\n<li>Are looking for a dynamic career in retail</li>\n</ul>\n<p>Drakes Supermarkets is the company for you. A family owned and operated private company, we are Australia's largest independently-owned supermarket chain. Due to our unprecedented growth, we can provide either an excellent career opportunity or hours of work to fit in with your lifestyle.</p>\n<p>Working as a part of an enthusiastic team, in a highly competitive supermarket environment, applicants will be expected to:</p>\n<ul>\n<li>Demonstrate passion and enthusiasm</li>\n<li>Show commitment to good team and customer relations</li>\n<li>Have excellent communication skills</li>\n<li>Be reliable and self-motivated</li>\n<li>Be able to work as part of a small and dedicated team</li>\n<li>Have high standards of personal hygiene and appearance</li>\n<li>Show commitment to work health and safety standards</li>\n</ul></div>",
    "url": "https://drakesupermarkets.expr3ss.com/jobDetails?selectJob=2299&s=239"
  },
  {
    "job_title": "Communications and Events Officer - Full Time or Part-Time",
    "advertiser": "Enhanced Lifestyles",
    "job_type": "Marketing Communications (Marketing & Communications)",
    "location": "Hindmarsh, Adelaide SA",
    "work_type": "Full time, Part time",
    "summary": "<div class=\"_1oozmqe0 bmnci70\"><div><div>\n<p>Are you a creative powerhouse with a passion for storytelling,\nengagement and events? Enhanced Lifestyles is seeking a vibrant\nindividual to join our team as a Communications and Events\nOfficer.</p>\n<p><strong>About Us:</strong><br>\nEnhanced Lifestyles is a not-for-profit organisation dedicated to\nenriching the lives of our customers through personalised and\nrespectful services. Governed by our members and guided by\nindividuals living with disabilities, we prioritise our customers'\nneeds above all else.</p>\n<p><strong>About the Role:</strong><br>\nAs our Communications and Events Officer, you will be instrumental\nin shaping the voice of our organisation and driving meaningful\nengagement with our community. Reporting to the Marketing &amp;\nCommunication Manager, you will be responsible for crafting\ncompelling content across various mediums including written, video,\nand imagery. Your creative ability will drive the creation,\nmanagement, and promotion of marketing, communication, and event\nmaterials, well as the planning, implementation and coordination of\ncustomer events, to support Enhanced Lifestyles.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop, write and edit marketing and communications materials,\nincluding brochures, newsletters, press releases, blog posts and\nsocial media content. </li>\n<li>Strategically promote communications and marketing materials\nacross diverse social channels.</li>\n<li>Analyse and track campaign analytics, providing insightful\nreports on successes and areas for improvement.</li>\n<li>Ensure all communications and marketing material adhere to\nbrand standards, maintaining brand integrity.</li>\n<li>Collaborate with the Marketing team to implement effective\ncommunications strategies and campaigns.</li>\n<li>Support the organisation in managing media inquiries and\ndeveloping timely responses.</li>\n<li>Ensure the website remains current and accurate by regularly\nupdating content, including information, links, brochures, and blog\nposts. </li>\n<li>Assist in developing the annual customer events calendar. </li>\n<li>Plan, implement, and coordinate customer and staff events.\n</li>\n<li>Create and implement promotional materials and strategies to\ngenerate participation and engagement in events for both customers\nand employees. </li>\n</ul>\n<p><strong>About You:</strong></p>\n<p>Are you an engaging and innovative communicator with experience\nin event coordination? We're looking for someone who:</p>\n<ul>\n<li>Possesses experience with a range of platforms including\nWordPress, Adobe Suite, Hootsuite, Mailchimp, and Canva.</li>\n<li>Thrives on engaging with customers and staff through various\ncommunication platforms end events.</li>\n<li>Demonstrates initiative and a passion for driving meaningful\nengagement.</li>\n<li>Embraces challenges and seeks innovative solutions to\ncommunication needs.</li>\n<li>Has experience in event coordination.</li>\n</ul>\n<p><strong>Join Our Team:</strong></p>\n<p>At Enhanced Lifestyles, we offer more than just a job - we offer\na vibrant community committed to making a positive impact. In\naddition to competitive benefits and salary packaging benefits (up\nto $15,899 tax-free), you'll have the opportunity to grow both\npersonally and professionally in a collaborative and supportive\nwork environment.</p>\n<p>If you're ready to embark on a journey where your creativity and\npassion can make a real difference, we want to hear from you!</p>\n<p>Enhanced Lifestyles is an equal opportunity employer committed\nto fostering diversity and inclusion. Join us in our mission to\nempower individuals and enhance lives through our customer-focused\napproach.</p>\n<p>Apply now to be a part of our dynamic team! Applications close at\n<strong>5pm on Tuesday 10 June 2025</strong>, however we will be\nreviewing applications as they come in and may move to interview\nbefore the closing date if the right candidate is identified. Early\napplications are encouraged.</p>\n<p><strong>Privacy Policy</strong></p>\n</div></div></div>",
    "url": "https://enhancedlifestyles.com.au/careers/#available-roles"
  },
  {
    "job_title": "Work at One of Adelaide’s Iconic Venues – The Mile End Hotel Is Hiring!",
    "advertiser": "Australian Venue Co",
    "job_type": "Bar & Beverage Staff (Hospitality & Tourism)",
    "location": "Adelaide SA",
    "work_type": "Casual/Vacation",
    "summary": "<div class=\"_1oozmqe0 bmnci70\"><div>\n<p>\n \n <b>Job no:</b> 524477<br>\n <b>Work type:</b> Casual / Temp<br>\n <b>Location:</b> Adelaide<br>\n <b>Categories:</b> Food and Beverage, Gaming<br>\n</p>\n<div>\n <p><strong>Exciting Hospitality Opportunities at The Mile End Hotel!</strong></p>\n<p>Located just outside Adelaide’s CBD, The Mile End Hotel is a much-loved venue known for its unique blend of heritage charm and contemporary hospitality. With a bustling bar, vibrant bistro, and loyal local crowd, it’s a fantastic place to build your career in hospitality.</p>\n<p><strong>We’re Hiring!</strong></p>\n<p>We’re on the lookout for enthusiastic <strong>TAB/Gaming Attendants, Food &amp; Beverage Attendants, Front of House Waiters/Waitresses, Bartenders </strong>to join our friendly team. If you’re passionate about great service and looking for a rewarding opportunity – we’d love to hear from you!</p>\n<p><strong>Why Join Us?</strong></p>\n<ul>\n<li>Work in a respected and vibrant local venue</li>\n<li>Enjoy staff discounts across 200+ venues throughout Australia &amp; NZ</li>\n<li>Career development and training opportunities</li>\n<li>Supportive team environment with work-life balance</li>\n</ul>\n<p><strong>What We’re Looking For:</strong></p>\n<ul>\n<li>Experience required for TAB, Gaming, and Bartender roles</li>\n<li>No experience necessary for Food &amp; Beverage or Front of House roles – just a great attitude!</li>\n<li><strong>RSA and RSG certifications are required</strong></li>\n<li>Availability across nights and weekends preferred</li>\n</ul>\n<p><strong>Roles Available:</strong></p>\n<ul>\n<li>\n<strong>TAB/Gaming Attendants:</strong> Confident and experienced individuals who can manage TAB operations and provide excellent customer service in a fast-paced environment.</li>\n<li>\n<strong>Food &amp; Beverage Attendants:</strong> Friendly, proactive team members to deliver great service in our bar and dining areas.</li>\n<li>\n<strong>Bartenders:</strong> Skilled individuals with a passion for mixology and customer interaction in a lively bar setting.</li>\n</ul>\n<p>If you're ready to be part of a well-established venue with a great team culture – apply now!</p>\n</div>\n<p>\n <b>Advertised:</b> 30 May 2025 Cen. Australia Standard Time<br>\n <b>Applications close:</b> \n</p>\n</div></div>",
    "url": "https://careers.ausvenueco.com.au/en/job/524477/work-at-one-of-adelaides-iconic-venues-the-mile-end-hotel-is-hiring?seek-token=81rTv61sCFMynYEbUog6NX"
  },
  {
    "job_title": "Member Support Consultant | Royal Park",
    "advertiser": "Goodlife Health Clubs",
    "job_type": "Sales Representatives/Consultants (Sales)",
    "location": "Adelaide SA",
    "work_type": "Casual/Vacation",
    "summary": "<div class=\"_1oozmqe0 bmnci70\"><div><div>\n <strong></strong><br>\n \n<p><strong>About Goodlife Health Clubs:</strong></p>\n<p>As Australia's premier, privately-owned fitness organisation, <strong>Goodlife Health Clubs</strong> is in a unique position to kickstart your career in the sector. We currently operate&nbsp;<strong>97 premium clubs </strong>in Queensland, Victoria, South Australia, and Western Australia - providing improved health, well-being and a sense of accomplishment to more than 270,000 members. Our members enjoy access to industry-leading gym facilities, innovative group fitness classes and bespoke personal training solutions - empowering people throughout Australia to live the Goodlife.</p>\n<p>As both a service provider and employer our mission is simple: Move people to achieve great things.</p>\n<p><strong>The opportunity:</strong></p>\n<p><strong>Member Support Consultants</strong> (MSC's) at our <strong>Royal Park</strong> club play an essential role in building and maintaining a thriving <strong>Goodlife Health Club</strong> membership base. MSC's are the first people to interact with prospective members and inspire them to begin their wellness journey with us - they are responsible for helping thousands of people become faster, fitter, stronger and happier versions of themselves.</p>\n<p>The role of an MSC is highly varied and has two clear goals – achieving membership growth goals through proactive sales activities and retaining existing members through the provision of “best-in-class\" customer service. MCS's are experts in all things <strong>Goodlife</strong>: They can seamlessly swap between sales and lead generation; Providing exceptional service and achieving successful customer outcomes on the reception desk and; Proactively communicating with current members to enhance their club experience and drive positive member retention.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Proactively contribute to club sales budget utilising sales promotions and referrals campaigns</li>\n<li>Generating and converting high-quality sales leads through community outreach, seeking referrals and the identification of new business opportunities</li>\n<li>Achieving the required number of lead contacts via telephone to maximise sales opportunities</li>\n<li>Providing sales presentations and tours to prospective members</li>\n<li>Creating great member journeys via positive and personalised interactions</li>\n<li>Achieving successful outcomes to enquiries</li>\n<li>Opening and closing the club as per the club roster</li>\n<li>Active involvement in member retention programs, inspiring members to continue their fitness journey</li>\n<li>Regular service calls to new and existing members to keep them engaged in their journey - recommending club-based products that would boost their results and amplify their experience</li>\n</ul>\n<p><strong>About you:</strong></p>\n<ul>\n<li>Current First Aid &amp; CPR certificates</li>\n<li>A current valid Working with Children Check</li>\n<li>Ability to build rapport with people from varied walks of life with a desire to help people succeed in their goals</li>\n<li>The ability to solve problems, and overcome obstacles</li>\n<li>Outstanding communication abilities - able to listen, understand, empathise and influence others</li>\n<li>Tenacity with a natural drive to achieve individual targets and team goals</li>\n<li>Customer focused with a desire to achieve exceptional customer outcomes</li>\n</ul>\n<p><strong>What we can offer you:</strong></p>\n<p>A career in the fitness industry is a career like no other. With <strong>Goodlife Health Clubs</strong>, the actions you take every day will inspire others and positively impact the health, well-being and confidence of people across your community.</p>\n<p><strong>In addition, we offer:</strong></p>\n<ul>\n<li>An hourly rate of $30.13 (inclusive of casual loading)</li>\n<li>Commission</li>\n<li>A complimentary all-access Goodlife membership</li>\n<li>Career opportunities with Fitness and Lifestyle Group - Asia Pacific's largest diversified fitness group - develop your career across our brands, locations and disciplines</li>\n</ul>\n<p>Elevate your professional and personal growth withaccess to our industry leading learning and development content.&nbsp;Dive into the&nbsp;FLG Learning Hub, your one-stop shop for&nbsp;90,000+ online courses!&nbsp;From mastering languages to becoming a presentation pro, and from&nbsp;acing&nbsp;customer service to ruling social media,&nbsp;we've&nbsp;got what you need to excel.&nbsp;Plus, get excited with&nbsp;Blinkist! Explore a curated collection of engaging reads to boost your brainpower anytime, anywhere.&nbsp;Get ready to unleash your potential and conquer new heights, both personally and professionally, with our exciting learning and development content!</p>\n<p><strong>About Fitness &amp; Lifestyle Group:</strong></p>\n<p><strong>Fitness and Lifestyle Group (FLG)</strong> is the leading fitness, health, and wellness group in the Asia-Pacific region, headquartered in Australia. Our mission is to make a meaningful, positive impact on people's lives through innovative and diverse health and wellness offerings, both physical and digital.</p>\n<p>FLG's portfolio includes globally recognised brands such as <strong>Fitness First Australia</strong>, <strong>Goodlife Health Clubs Australia</strong>, <strong>Jetts Fitness New Zealand &amp; Thailand</strong>, <strong>Zap Fitness</strong>, and <strong>Barry's</strong>. With 319 locations across Australia, New Zealand, and Southeast Asia, we support over 585,000 members in leading healthier, more active lives.</p>\n<p><strong>Apply Now!</strong></p>\n<p>Please visit our website: careers.fitlg.com for a list of all of our current vacancies and to register for job alerts in your area.</p>\n<div>\n<p><strong>Our Commitment to Diversity and Inclusion:&nbsp;</strong></p>\n</div>\n<div>\n<p>At Fitness and Lifestyle Group we bring positive energy and attitude to work every day, we are proud of who we are and who we work for. We&nbsp;don't&nbsp;just accept individuality; we encourage it and acknowledge the value&nbsp;diversity&nbsp;and inclusivity brings to our&nbsp;organisation. We pride ourselves on&nbsp;empowering our team to be&nbsp;their&nbsp;authentic selves at work.&nbsp;</p>\n</div>\n<div>\n<p>We welcome&nbsp;applications from Aboriginal and Torres Strait Islander People,&nbsp;people of all&nbsp;ages, race, sex, intersex status, gender identity, sexual orientation, people&nbsp;with a disability and from other diverse backgrounds.&nbsp;</p>\n</div>\n </div></div></div>",
    "url": "https://careers.goodlife.com.au/jobs/19564/FLG-1864030"
  }
]